D:\Software\Conda\envs\project\python.exe D:\数据挖掘\大作业\X_ray\test.py 
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 127, 127]          23,296
              ReLU-2         [-1, 64, 127, 127]               0
         MaxPool2d-3           [-1, 64, 63, 63]               0
            Conv2d-4          [-1, 192, 63, 63]         307,392
              ReLU-5          [-1, 192, 63, 63]               0
         MaxPool2d-6          [-1, 192, 31, 31]               0
            Conv2d-7          [-1, 384, 31, 31]         663,936
              ReLU-8          [-1, 384, 31, 31]               0
            Conv2d-9          [-1, 256, 31, 31]         884,992
             ReLU-10          [-1, 256, 31, 31]               0
           Conv2d-11          [-1, 256, 31, 31]         590,080
             ReLU-12          [-1, 256, 31, 31]               0
        MaxPool2d-13          [-1, 256, 15, 15]               0
AdaptiveAvgPool2d-14            [-1, 256, 6, 6]               0
          Dropout-15                 [-1, 9216]               0
           Linear-16                 [-1, 4096]      37,752,832
             ReLU-17                 [-1, 4096]               0
          Dropout-18                 [-1, 4096]               0
           Linear-19                 [-1, 4096]      16,781,312
             ReLU-20                 [-1, 4096]               0
           Linear-21                 [-1, 1000]       4,097,000
================================================================
Total params: 61,100,840
Trainable params: 61,100,840
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 44.61
Params size (MB): 233.08
Estimated Total Size (MB): 280.69
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 512, 512]           1,792
              ReLU-2         [-1, 64, 512, 512]               0
            Conv2d-3         [-1, 64, 512, 512]          36,928
              ReLU-4         [-1, 64, 512, 512]               0
         MaxPool2d-5         [-1, 64, 256, 256]               0
            Conv2d-6        [-1, 128, 256, 256]          73,856
              ReLU-7        [-1, 128, 256, 256]               0
            Conv2d-8        [-1, 128, 256, 256]         147,584
              ReLU-9        [-1, 128, 256, 256]               0
        MaxPool2d-10        [-1, 128, 128, 128]               0
           Conv2d-11        [-1, 256, 128, 128]         295,168
             ReLU-12        [-1, 256, 128, 128]               0
           Conv2d-13        [-1, 256, 128, 128]         590,080
             ReLU-14        [-1, 256, 128, 128]               0
           Conv2d-15        [-1, 256, 128, 128]         590,080
             ReLU-16        [-1, 256, 128, 128]               0
        MaxPool2d-17          [-1, 256, 64, 64]               0
           Conv2d-18          [-1, 512, 64, 64]       1,180,160
             ReLU-19          [-1, 512, 64, 64]               0
           Conv2d-20          [-1, 512, 64, 64]       2,359,808
             ReLU-21          [-1, 512, 64, 64]               0
           Conv2d-22          [-1, 512, 64, 64]       2,359,808
             ReLU-23          [-1, 512, 64, 64]               0
        MaxPool2d-24          [-1, 512, 32, 32]               0
           Conv2d-25          [-1, 512, 32, 32]       2,359,808
             ReLU-26          [-1, 512, 32, 32]               0
           Conv2d-27          [-1, 512, 32, 32]       2,359,808
             ReLU-28          [-1, 512, 32, 32]               0
           Conv2d-29          [-1, 512, 32, 32]       2,359,808
             ReLU-30          [-1, 512, 32, 32]               0
        MaxPool2d-31          [-1, 512, 16, 16]               0
AdaptiveAvgPool2d-32            [-1, 512, 7, 7]               0
           Linear-33                 [-1, 4096]     102,764,544
             ReLU-34                 [-1, 4096]               0
          Dropout-35                 [-1, 4096]               0
           Linear-36                 [-1, 4096]      16,781,312
             ReLU-37                 [-1, 4096]               0
          Dropout-38                 [-1, 4096]               0
           Linear-39                 [-1, 1000]       4,097,000
================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 1141.39
Params size (MB): 527.79
Estimated Total Size (MB): 1672.18
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           9,408
       BatchNorm2d-2         [-1, 64, 256, 256]             128
              ReLU-3         [-1, 64, 256, 256]               0
         MaxPool2d-4         [-1, 64, 128, 128]               0
            Conv2d-5         [-1, 64, 128, 128]          36,864
       BatchNorm2d-6         [-1, 64, 128, 128]             128
              ReLU-7         [-1, 64, 128, 128]               0
            Conv2d-8         [-1, 64, 128, 128]          36,864
       BatchNorm2d-9         [-1, 64, 128, 128]             128
             ReLU-10         [-1, 64, 128, 128]               0
       BasicBlock-11         [-1, 64, 128, 128]               0
           Conv2d-12         [-1, 64, 128, 128]          36,864
      BatchNorm2d-13         [-1, 64, 128, 128]             128
             ReLU-14         [-1, 64, 128, 128]               0
           Conv2d-15         [-1, 64, 128, 128]          36,864
      BatchNorm2d-16         [-1, 64, 128, 128]             128
             ReLU-17         [-1, 64, 128, 128]               0
       BasicBlock-18         [-1, 64, 128, 128]               0
           Conv2d-19          [-1, 128, 64, 64]          73,728
      BatchNorm2d-20          [-1, 128, 64, 64]             256
             ReLU-21          [-1, 128, 64, 64]               0
           Conv2d-22          [-1, 128, 64, 64]         147,456
      BatchNorm2d-23          [-1, 128, 64, 64]             256
           Conv2d-24          [-1, 128, 64, 64]           8,192
      BatchNorm2d-25          [-1, 128, 64, 64]             256
             ReLU-26          [-1, 128, 64, 64]               0
       BasicBlock-27          [-1, 128, 64, 64]               0
           Conv2d-28          [-1, 128, 64, 64]         147,456
      BatchNorm2d-29          [-1, 128, 64, 64]             256
             ReLU-30          [-1, 128, 64, 64]               0
           Conv2d-31          [-1, 128, 64, 64]         147,456
      BatchNorm2d-32          [-1, 128, 64, 64]             256
             ReLU-33          [-1, 128, 64, 64]               0
       BasicBlock-34          [-1, 128, 64, 64]               0
           Conv2d-35          [-1, 256, 32, 32]         294,912
      BatchNorm2d-36          [-1, 256, 32, 32]             512
             ReLU-37          [-1, 256, 32, 32]               0
           Conv2d-38          [-1, 256, 32, 32]         589,824
      BatchNorm2d-39          [-1, 256, 32, 32]             512
           Conv2d-40          [-1, 256, 32, 32]          32,768
      BatchNorm2d-41          [-1, 256, 32, 32]             512
             ReLU-42          [-1, 256, 32, 32]               0
       BasicBlock-43          [-1, 256, 32, 32]               0
           Conv2d-44          [-1, 256, 32, 32]         589,824
      BatchNorm2d-45          [-1, 256, 32, 32]             512
             ReLU-46          [-1, 256, 32, 32]               0
           Conv2d-47          [-1, 256, 32, 32]         589,824
      BatchNorm2d-48          [-1, 256, 32, 32]             512
             ReLU-49          [-1, 256, 32, 32]               0
       BasicBlock-50          [-1, 256, 32, 32]               0
           Conv2d-51          [-1, 512, 16, 16]       1,179,648
      BatchNorm2d-52          [-1, 512, 16, 16]           1,024
             ReLU-53          [-1, 512, 16, 16]               0
           Conv2d-54          [-1, 512, 16, 16]       2,359,296
      BatchNorm2d-55          [-1, 512, 16, 16]           1,024
           Conv2d-56          [-1, 512, 16, 16]         131,072
      BatchNorm2d-57          [-1, 512, 16, 16]           1,024
             ReLU-58          [-1, 512, 16, 16]               0
       BasicBlock-59          [-1, 512, 16, 16]               0
           Conv2d-60          [-1, 512, 16, 16]       2,359,296
      BatchNorm2d-61          [-1, 512, 16, 16]           1,024
             ReLU-62          [-1, 512, 16, 16]               0
           Conv2d-63          [-1, 512, 16, 16]       2,359,296
      BatchNorm2d-64          [-1, 512, 16, 16]           1,024
             ReLU-65          [-1, 512, 16, 16]               0
       BasicBlock-66          [-1, 512, 16, 16]               0
AdaptiveAvgPool2d-67            [-1, 512, 1, 1]               0
           Linear-68                 [-1, 1000]         513,000
================================================================
Total params: 11,689,512
Trainable params: 11,689,512
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 328.01
Params size (MB): 44.59
Estimated Total Size (MB): 375.60
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 256, 256]             864
       BatchNorm2d-2         [-1, 32, 256, 256]              64
              SiLU-3         [-1, 32, 256, 256]               0
            Conv2d-4         [-1, 32, 256, 256]             288
       BatchNorm2d-5         [-1, 32, 256, 256]              64
              SiLU-6         [-1, 32, 256, 256]               0
 AdaptiveAvgPool2d-7             [-1, 32, 1, 1]               0
            Conv2d-8              [-1, 8, 1, 1]             264
              SiLU-9              [-1, 8, 1, 1]               0
           Conv2d-10             [-1, 32, 1, 1]             288
          Sigmoid-11             [-1, 32, 1, 1]               0
SqueezeExcitation-12         [-1, 32, 256, 256]               0
           Conv2d-13         [-1, 16, 256, 256]             512
      BatchNorm2d-14         [-1, 16, 256, 256]              32
           MBConv-15         [-1, 16, 256, 256]               0
           Conv2d-16         [-1, 96, 256, 256]           1,536
      BatchNorm2d-17         [-1, 96, 256, 256]             192
             SiLU-18         [-1, 96, 256, 256]               0
           Conv2d-19         [-1, 96, 128, 128]             864
      BatchNorm2d-20         [-1, 96, 128, 128]             192
             SiLU-21         [-1, 96, 128, 128]               0
AdaptiveAvgPool2d-22             [-1, 96, 1, 1]               0
           Conv2d-23              [-1, 4, 1, 1]             388
             SiLU-24              [-1, 4, 1, 1]               0
           Conv2d-25             [-1, 96, 1, 1]             480
          Sigmoid-26             [-1, 96, 1, 1]               0
SqueezeExcitation-27         [-1, 96, 128, 128]               0
           Conv2d-28         [-1, 24, 128, 128]           2,304
      BatchNorm2d-29         [-1, 24, 128, 128]              48
           MBConv-30         [-1, 24, 128, 128]               0
           Conv2d-31        [-1, 144, 128, 128]           3,456
      BatchNorm2d-32        [-1, 144, 128, 128]             288
             SiLU-33        [-1, 144, 128, 128]               0
           Conv2d-34        [-1, 144, 128, 128]           1,296
      BatchNorm2d-35        [-1, 144, 128, 128]             288
             SiLU-36        [-1, 144, 128, 128]               0
AdaptiveAvgPool2d-37            [-1, 144, 1, 1]               0
           Conv2d-38              [-1, 6, 1, 1]             870
             SiLU-39              [-1, 6, 1, 1]               0
           Conv2d-40            [-1, 144, 1, 1]           1,008
          Sigmoid-41            [-1, 144, 1, 1]               0
SqueezeExcitation-42        [-1, 144, 128, 128]               0
           Conv2d-43         [-1, 24, 128, 128]           3,456
      BatchNorm2d-44         [-1, 24, 128, 128]              48
  StochasticDepth-45         [-1, 24, 128, 128]               0
           MBConv-46         [-1, 24, 128, 128]               0
           Conv2d-47        [-1, 144, 128, 128]           3,456
      BatchNorm2d-48        [-1, 144, 128, 128]             288
             SiLU-49        [-1, 144, 128, 128]               0
           Conv2d-50          [-1, 144, 64, 64]           3,600
      BatchNorm2d-51          [-1, 144, 64, 64]             288
             SiLU-52          [-1, 144, 64, 64]               0
AdaptiveAvgPool2d-53            [-1, 144, 1, 1]               0
           Conv2d-54              [-1, 6, 1, 1]             870
             SiLU-55              [-1, 6, 1, 1]               0
           Conv2d-56            [-1, 144, 1, 1]           1,008
          Sigmoid-57            [-1, 144, 1, 1]               0
SqueezeExcitation-58          [-1, 144, 64, 64]               0
           Conv2d-59           [-1, 40, 64, 64]           5,760
      BatchNorm2d-60           [-1, 40, 64, 64]              80
           MBConv-61           [-1, 40, 64, 64]               0
           Conv2d-62          [-1, 240, 64, 64]           9,600
      BatchNorm2d-63          [-1, 240, 64, 64]             480
             SiLU-64          [-1, 240, 64, 64]               0
           Conv2d-65          [-1, 240, 64, 64]           6,000
      BatchNorm2d-66          [-1, 240, 64, 64]             480
             SiLU-67          [-1, 240, 64, 64]               0
AdaptiveAvgPool2d-68            [-1, 240, 1, 1]               0
           Conv2d-69             [-1, 10, 1, 1]           2,410
             SiLU-70             [-1, 10, 1, 1]               0
           Conv2d-71            [-1, 240, 1, 1]           2,640
          Sigmoid-72            [-1, 240, 1, 1]               0
SqueezeExcitation-73          [-1, 240, 64, 64]               0
           Conv2d-74           [-1, 40, 64, 64]           9,600
      BatchNorm2d-75           [-1, 40, 64, 64]              80
  StochasticDepth-76           [-1, 40, 64, 64]               0
           MBConv-77           [-1, 40, 64, 64]               0
           Conv2d-78          [-1, 240, 64, 64]           9,600
      BatchNorm2d-79          [-1, 240, 64, 64]             480
             SiLU-80          [-1, 240, 64, 64]               0
           Conv2d-81          [-1, 240, 32, 32]           2,160
      BatchNorm2d-82          [-1, 240, 32, 32]             480
             SiLU-83          [-1, 240, 32, 32]               0
AdaptiveAvgPool2d-84            [-1, 240, 1, 1]               0
           Conv2d-85             [-1, 10, 1, 1]           2,410
             SiLU-86             [-1, 10, 1, 1]               0
           Conv2d-87            [-1, 240, 1, 1]           2,640
          Sigmoid-88            [-1, 240, 1, 1]               0
SqueezeExcitation-89          [-1, 240, 32, 32]               0
           Conv2d-90           [-1, 80, 32, 32]          19,200
      BatchNorm2d-91           [-1, 80, 32, 32]             160
           MBConv-92           [-1, 80, 32, 32]               0
           Conv2d-93          [-1, 480, 32, 32]          38,400
      BatchNorm2d-94          [-1, 480, 32, 32]             960
             SiLU-95          [-1, 480, 32, 32]               0
           Conv2d-96          [-1, 480, 32, 32]           4,320
      BatchNorm2d-97          [-1, 480, 32, 32]             960
             SiLU-98          [-1, 480, 32, 32]               0
AdaptiveAvgPool2d-99            [-1, 480, 1, 1]               0
          Conv2d-100             [-1, 20, 1, 1]           9,620
            SiLU-101             [-1, 20, 1, 1]               0
          Conv2d-102            [-1, 480, 1, 1]          10,080
         Sigmoid-103            [-1, 480, 1, 1]               0
SqueezeExcitation-104          [-1, 480, 32, 32]               0
          Conv2d-105           [-1, 80, 32, 32]          38,400
     BatchNorm2d-106           [-1, 80, 32, 32]             160
 StochasticDepth-107           [-1, 80, 32, 32]               0
          MBConv-108           [-1, 80, 32, 32]               0
          Conv2d-109          [-1, 480, 32, 32]          38,400
     BatchNorm2d-110          [-1, 480, 32, 32]             960
            SiLU-111          [-1, 480, 32, 32]               0
          Conv2d-112          [-1, 480, 32, 32]           4,320
     BatchNorm2d-113          [-1, 480, 32, 32]             960
            SiLU-114          [-1, 480, 32, 32]               0
AdaptiveAvgPool2d-115            [-1, 480, 1, 1]               0
          Conv2d-116             [-1, 20, 1, 1]           9,620
            SiLU-117             [-1, 20, 1, 1]               0
          Conv2d-118            [-1, 480, 1, 1]          10,080
         Sigmoid-119            [-1, 480, 1, 1]               0
SqueezeExcitation-120          [-1, 480, 32, 32]               0
          Conv2d-121           [-1, 80, 32, 32]          38,400
     BatchNorm2d-122           [-1, 80, 32, 32]             160
 StochasticDepth-123           [-1, 80, 32, 32]               0
          MBConv-124           [-1, 80, 32, 32]               0
          Conv2d-125          [-1, 480, 32, 32]          38,400
     BatchNorm2d-126          [-1, 480, 32, 32]             960
            SiLU-127          [-1, 480, 32, 32]               0
          Conv2d-128          [-1, 480, 32, 32]          12,000
     BatchNorm2d-129          [-1, 480, 32, 32]             960
            SiLU-130          [-1, 480, 32, 32]               0
AdaptiveAvgPool2d-131            [-1, 480, 1, 1]               0
          Conv2d-132             [-1, 20, 1, 1]           9,620
            SiLU-133             [-1, 20, 1, 1]               0
          Conv2d-134            [-1, 480, 1, 1]          10,080
         Sigmoid-135            [-1, 480, 1, 1]               0
SqueezeExcitation-136          [-1, 480, 32, 32]               0
          Conv2d-137          [-1, 112, 32, 32]          53,760
     BatchNorm2d-138          [-1, 112, 32, 32]             224
          MBConv-139          [-1, 112, 32, 32]               0
          Conv2d-140          [-1, 672, 32, 32]          75,264
     BatchNorm2d-141          [-1, 672, 32, 32]           1,344
            SiLU-142          [-1, 672, 32, 32]               0
          Conv2d-143          [-1, 672, 32, 32]          16,800
     BatchNorm2d-144          [-1, 672, 32, 32]           1,344
            SiLU-145          [-1, 672, 32, 32]               0
AdaptiveAvgPool2d-146            [-1, 672, 1, 1]               0
          Conv2d-147             [-1, 28, 1, 1]          18,844
            SiLU-148             [-1, 28, 1, 1]               0
          Conv2d-149            [-1, 672, 1, 1]          19,488
         Sigmoid-150            [-1, 672, 1, 1]               0
SqueezeExcitation-151          [-1, 672, 32, 32]               0
          Conv2d-152          [-1, 112, 32, 32]          75,264
     BatchNorm2d-153          [-1, 112, 32, 32]             224
 StochasticDepth-154          [-1, 112, 32, 32]               0
          MBConv-155          [-1, 112, 32, 32]               0
          Conv2d-156          [-1, 672, 32, 32]          75,264
     BatchNorm2d-157          [-1, 672, 32, 32]           1,344
            SiLU-158          [-1, 672, 32, 32]               0
          Conv2d-159          [-1, 672, 32, 32]          16,800
     BatchNorm2d-160          [-1, 672, 32, 32]           1,344
            SiLU-161          [-1, 672, 32, 32]               0
AdaptiveAvgPool2d-162            [-1, 672, 1, 1]               0
          Conv2d-163             [-1, 28, 1, 1]          18,844
            SiLU-164             [-1, 28, 1, 1]               0
          Conv2d-165            [-1, 672, 1, 1]          19,488
         Sigmoid-166            [-1, 672, 1, 1]               0
SqueezeExcitation-167          [-1, 672, 32, 32]               0
          Conv2d-168          [-1, 112, 32, 32]          75,264
     BatchNorm2d-169          [-1, 112, 32, 32]             224
 StochasticDepth-170          [-1, 112, 32, 32]               0
          MBConv-171          [-1, 112, 32, 32]               0
          Conv2d-172          [-1, 672, 32, 32]          75,264
     BatchNorm2d-173          [-1, 672, 32, 32]           1,344
            SiLU-174          [-1, 672, 32, 32]               0
          Conv2d-175          [-1, 672, 16, 16]          16,800
     BatchNorm2d-176          [-1, 672, 16, 16]           1,344
            SiLU-177          [-1, 672, 16, 16]               0
AdaptiveAvgPool2d-178            [-1, 672, 1, 1]               0
          Conv2d-179             [-1, 28, 1, 1]          18,844
            SiLU-180             [-1, 28, 1, 1]               0
          Conv2d-181            [-1, 672, 1, 1]          19,488
         Sigmoid-182            [-1, 672, 1, 1]               0
SqueezeExcitation-183          [-1, 672, 16, 16]               0
          Conv2d-184          [-1, 192, 16, 16]         129,024
     BatchNorm2d-185          [-1, 192, 16, 16]             384
          MBConv-186          [-1, 192, 16, 16]               0
          Conv2d-187         [-1, 1152, 16, 16]         221,184
     BatchNorm2d-188         [-1, 1152, 16, 16]           2,304
            SiLU-189         [-1, 1152, 16, 16]               0
          Conv2d-190         [-1, 1152, 16, 16]          28,800
     BatchNorm2d-191         [-1, 1152, 16, 16]           2,304
            SiLU-192         [-1, 1152, 16, 16]               0
AdaptiveAvgPool2d-193           [-1, 1152, 1, 1]               0
          Conv2d-194             [-1, 48, 1, 1]          55,344
            SiLU-195             [-1, 48, 1, 1]               0
          Conv2d-196           [-1, 1152, 1, 1]          56,448
         Sigmoid-197           [-1, 1152, 1, 1]               0
SqueezeExcitation-198         [-1, 1152, 16, 16]               0
          Conv2d-199          [-1, 192, 16, 16]         221,184
     BatchNorm2d-200          [-1, 192, 16, 16]             384
 StochasticDepth-201          [-1, 192, 16, 16]               0
          MBConv-202          [-1, 192, 16, 16]               0
          Conv2d-203         [-1, 1152, 16, 16]         221,184
     BatchNorm2d-204         [-1, 1152, 16, 16]           2,304
            SiLU-205         [-1, 1152, 16, 16]               0
          Conv2d-206         [-1, 1152, 16, 16]          28,800
     BatchNorm2d-207         [-1, 1152, 16, 16]           2,304
            SiLU-208         [-1, 1152, 16, 16]               0
AdaptiveAvgPool2d-209           [-1, 1152, 1, 1]               0
          Conv2d-210             [-1, 48, 1, 1]          55,344
            SiLU-211             [-1, 48, 1, 1]               0
          Conv2d-212           [-1, 1152, 1, 1]          56,448
         Sigmoid-213           [-1, 1152, 1, 1]               0
SqueezeExcitation-214         [-1, 1152, 16, 16]               0
          Conv2d-215          [-1, 192, 16, 16]         221,184
     BatchNorm2d-216          [-1, 192, 16, 16]             384
 StochasticDepth-217          [-1, 192, 16, 16]               0
          MBConv-218          [-1, 192, 16, 16]               0
          Conv2d-219         [-1, 1152, 16, 16]         221,184
     BatchNorm2d-220         [-1, 1152, 16, 16]           2,304
            SiLU-221         [-1, 1152, 16, 16]               0
          Conv2d-222         [-1, 1152, 16, 16]          28,800
     BatchNorm2d-223         [-1, 1152, 16, 16]           2,304
            SiLU-224         [-1, 1152, 16, 16]               0
AdaptiveAvgPool2d-225           [-1, 1152, 1, 1]               0
          Conv2d-226             [-1, 48, 1, 1]          55,344
            SiLU-227             [-1, 48, 1, 1]               0
          Conv2d-228           [-1, 1152, 1, 1]          56,448
         Sigmoid-229           [-1, 1152, 1, 1]               0
SqueezeExcitation-230         [-1, 1152, 16, 16]               0
          Conv2d-231          [-1, 192, 16, 16]         221,184
     BatchNorm2d-232          [-1, 192, 16, 16]             384
 StochasticDepth-233          [-1, 192, 16, 16]               0
          MBConv-234          [-1, 192, 16, 16]               0
          Conv2d-235         [-1, 1152, 16, 16]         221,184
     BatchNorm2d-236         [-1, 1152, 16, 16]           2,304
            SiLU-237         [-1, 1152, 16, 16]               0
          Conv2d-238         [-1, 1152, 16, 16]          10,368
     BatchNorm2d-239         [-1, 1152, 16, 16]           2,304
            SiLU-240         [-1, 1152, 16, 16]               0
AdaptiveAvgPool2d-241           [-1, 1152, 1, 1]               0
          Conv2d-242             [-1, 48, 1, 1]          55,344
            SiLU-243             [-1, 48, 1, 1]               0
          Conv2d-244           [-1, 1152, 1, 1]          56,448
         Sigmoid-245           [-1, 1152, 1, 1]               0
SqueezeExcitation-246         [-1, 1152, 16, 16]               0
          Conv2d-247          [-1, 320, 16, 16]         368,640
     BatchNorm2d-248          [-1, 320, 16, 16]             640
          MBConv-249          [-1, 320, 16, 16]               0
          Conv2d-250         [-1, 1280, 16, 16]         409,600
     BatchNorm2d-251         [-1, 1280, 16, 16]           2,560
            SiLU-252         [-1, 1280, 16, 16]               0
AdaptiveAvgPool2d-253           [-1, 1280, 1, 1]               0
         Dropout-254                 [-1, 1280]               0
          Linear-255                 [-1, 1000]       1,281,000
================================================================
Total params: 5,288,548
Trainable params: 5,288,548
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 906.24
Params size (MB): 20.17
Estimated Total Size (MB): 929.41
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           9,408
       BatchNorm2d-2         [-1, 64, 256, 256]             128
              ReLU-3         [-1, 64, 256, 256]               0
         MaxPool2d-4         [-1, 64, 128, 128]               0
            Conv2d-5        [-1, 128, 128, 128]           8,192
       BatchNorm2d-6        [-1, 128, 128, 128]             256
              ReLU-7        [-1, 128, 128, 128]               0
            Conv2d-8        [-1, 128, 128, 128]           4,608
       BatchNorm2d-9        [-1, 128, 128, 128]             256
             ReLU-10        [-1, 128, 128, 128]               0
           Conv2d-11        [-1, 256, 128, 128]          32,768
      BatchNorm2d-12        [-1, 256, 128, 128]             512
           Conv2d-13        [-1, 256, 128, 128]          16,384
      BatchNorm2d-14        [-1, 256, 128, 128]             512
             ReLU-15        [-1, 256, 128, 128]               0
       Bottleneck-16        [-1, 256, 128, 128]               0
           Conv2d-17        [-1, 128, 128, 128]          32,768
      BatchNorm2d-18        [-1, 128, 128, 128]             256
             ReLU-19        [-1, 128, 128, 128]               0
           Conv2d-20        [-1, 128, 128, 128]           4,608
      BatchNorm2d-21        [-1, 128, 128, 128]             256
             ReLU-22        [-1, 128, 128, 128]               0
           Conv2d-23        [-1, 256, 128, 128]          32,768
      BatchNorm2d-24        [-1, 256, 128, 128]             512
             ReLU-25        [-1, 256, 128, 128]               0
       Bottleneck-26        [-1, 256, 128, 128]               0
           Conv2d-27        [-1, 128, 128, 128]          32,768
      BatchNorm2d-28        [-1, 128, 128, 128]             256
             ReLU-29        [-1, 128, 128, 128]               0
           Conv2d-30        [-1, 128, 128, 128]           4,608
      BatchNorm2d-31        [-1, 128, 128, 128]             256
             ReLU-32        [-1, 128, 128, 128]               0
           Conv2d-33        [-1, 256, 128, 128]          32,768
      BatchNorm2d-34        [-1, 256, 128, 128]             512
             ReLU-35        [-1, 256, 128, 128]               0
       Bottleneck-36        [-1, 256, 128, 128]               0
           Conv2d-37        [-1, 256, 128, 128]          65,536
      BatchNorm2d-38        [-1, 256, 128, 128]             512
             ReLU-39        [-1, 256, 128, 128]               0
           Conv2d-40          [-1, 256, 64, 64]          18,432
      BatchNorm2d-41          [-1, 256, 64, 64]             512
             ReLU-42          [-1, 256, 64, 64]               0
           Conv2d-43          [-1, 512, 64, 64]         131,072
      BatchNorm2d-44          [-1, 512, 64, 64]           1,024
           Conv2d-45          [-1, 512, 64, 64]         131,072
      BatchNorm2d-46          [-1, 512, 64, 64]           1,024
             ReLU-47          [-1, 512, 64, 64]               0
       Bottleneck-48          [-1, 512, 64, 64]               0
           Conv2d-49          [-1, 256, 64, 64]         131,072
      BatchNorm2d-50          [-1, 256, 64, 64]             512
             ReLU-51          [-1, 256, 64, 64]               0
           Conv2d-52          [-1, 256, 64, 64]          18,432
      BatchNorm2d-53          [-1, 256, 64, 64]             512
             ReLU-54          [-1, 256, 64, 64]               0
           Conv2d-55          [-1, 512, 64, 64]         131,072
      BatchNorm2d-56          [-1, 512, 64, 64]           1,024
             ReLU-57          [-1, 512, 64, 64]               0
       Bottleneck-58          [-1, 512, 64, 64]               0
           Conv2d-59          [-1, 256, 64, 64]         131,072
      BatchNorm2d-60          [-1, 256, 64, 64]             512
             ReLU-61          [-1, 256, 64, 64]               0
           Conv2d-62          [-1, 256, 64, 64]          18,432
      BatchNorm2d-63          [-1, 256, 64, 64]             512
             ReLU-64          [-1, 256, 64, 64]               0
           Conv2d-65          [-1, 512, 64, 64]         131,072
      BatchNorm2d-66          [-1, 512, 64, 64]           1,024
             ReLU-67          [-1, 512, 64, 64]               0
       Bottleneck-68          [-1, 512, 64, 64]               0
           Conv2d-69          [-1, 256, 64, 64]         131,072
      BatchNorm2d-70          [-1, 256, 64, 64]             512
             ReLU-71          [-1, 256, 64, 64]               0
           Conv2d-72          [-1, 256, 64, 64]          18,432
      BatchNorm2d-73          [-1, 256, 64, 64]             512
             ReLU-74          [-1, 256, 64, 64]               0
           Conv2d-75          [-1, 512, 64, 64]         131,072
      BatchNorm2d-76          [-1, 512, 64, 64]           1,024
             ReLU-77          [-1, 512, 64, 64]               0
       Bottleneck-78          [-1, 512, 64, 64]               0
           Conv2d-79          [-1, 512, 64, 64]         262,144
      BatchNorm2d-80          [-1, 512, 64, 64]           1,024
             ReLU-81          [-1, 512, 64, 64]               0
           Conv2d-82          [-1, 512, 32, 32]          73,728
      BatchNorm2d-83          [-1, 512, 32, 32]           1,024
             ReLU-84          [-1, 512, 32, 32]               0
           Conv2d-85         [-1, 1024, 32, 32]         524,288
      BatchNorm2d-86         [-1, 1024, 32, 32]           2,048
           Conv2d-87         [-1, 1024, 32, 32]         524,288
      BatchNorm2d-88         [-1, 1024, 32, 32]           2,048
             ReLU-89         [-1, 1024, 32, 32]               0
       Bottleneck-90         [-1, 1024, 32, 32]               0
           Conv2d-91          [-1, 512, 32, 32]         524,288
      BatchNorm2d-92          [-1, 512, 32, 32]           1,024
             ReLU-93          [-1, 512, 32, 32]               0
           Conv2d-94          [-1, 512, 32, 32]          73,728
      BatchNorm2d-95          [-1, 512, 32, 32]           1,024
             ReLU-96          [-1, 512, 32, 32]               0
           Conv2d-97         [-1, 1024, 32, 32]         524,288
      BatchNorm2d-98         [-1, 1024, 32, 32]           2,048
             ReLU-99         [-1, 1024, 32, 32]               0
      Bottleneck-100         [-1, 1024, 32, 32]               0
          Conv2d-101          [-1, 512, 32, 32]         524,288
     BatchNorm2d-102          [-1, 512, 32, 32]           1,024
            ReLU-103          [-1, 512, 32, 32]               0
          Conv2d-104          [-1, 512, 32, 32]          73,728
     BatchNorm2d-105          [-1, 512, 32, 32]           1,024
            ReLU-106          [-1, 512, 32, 32]               0
          Conv2d-107         [-1, 1024, 32, 32]         524,288
     BatchNorm2d-108         [-1, 1024, 32, 32]           2,048
            ReLU-109         [-1, 1024, 32, 32]               0
      Bottleneck-110         [-1, 1024, 32, 32]               0
          Conv2d-111          [-1, 512, 32, 32]         524,288
     BatchNorm2d-112          [-1, 512, 32, 32]           1,024
            ReLU-113          [-1, 512, 32, 32]               0
          Conv2d-114          [-1, 512, 32, 32]          73,728
     BatchNorm2d-115          [-1, 512, 32, 32]           1,024
            ReLU-116          [-1, 512, 32, 32]               0
          Conv2d-117         [-1, 1024, 32, 32]         524,288
     BatchNorm2d-118         [-1, 1024, 32, 32]           2,048
            ReLU-119         [-1, 1024, 32, 32]               0
      Bottleneck-120         [-1, 1024, 32, 32]               0
          Conv2d-121          [-1, 512, 32, 32]         524,288
     BatchNorm2d-122          [-1, 512, 32, 32]           1,024
            ReLU-123          [-1, 512, 32, 32]               0
          Conv2d-124          [-1, 512, 32, 32]          73,728
     BatchNorm2d-125          [-1, 512, 32, 32]           1,024
            ReLU-126          [-1, 512, 32, 32]               0
          Conv2d-127         [-1, 1024, 32, 32]         524,288
     BatchNorm2d-128         [-1, 1024, 32, 32]           2,048
            ReLU-129         [-1, 1024, 32, 32]               0
      Bottleneck-130         [-1, 1024, 32, 32]               0
          Conv2d-131          [-1, 512, 32, 32]         524,288
     BatchNorm2d-132          [-1, 512, 32, 32]           1,024
            ReLU-133          [-1, 512, 32, 32]               0
          Conv2d-134          [-1, 512, 32, 32]          73,728
     BatchNorm2d-135          [-1, 512, 32, 32]           1,024
            ReLU-136          [-1, 512, 32, 32]               0
          Conv2d-137         [-1, 1024, 32, 32]         524,288
     BatchNorm2d-138         [-1, 1024, 32, 32]           2,048
            ReLU-139         [-1, 1024, 32, 32]               0
      Bottleneck-140         [-1, 1024, 32, 32]               0
          Conv2d-141         [-1, 1024, 32, 32]       1,048,576
     BatchNorm2d-142         [-1, 1024, 32, 32]           2,048
            ReLU-143         [-1, 1024, 32, 32]               0
          Conv2d-144         [-1, 1024, 16, 16]         294,912
     BatchNorm2d-145         [-1, 1024, 16, 16]           2,048
            ReLU-146         [-1, 1024, 16, 16]               0
          Conv2d-147         [-1, 2048, 16, 16]       2,097,152
     BatchNorm2d-148         [-1, 2048, 16, 16]           4,096
          Conv2d-149         [-1, 2048, 16, 16]       2,097,152
     BatchNorm2d-150         [-1, 2048, 16, 16]           4,096
            ReLU-151         [-1, 2048, 16, 16]               0
      Bottleneck-152         [-1, 2048, 16, 16]               0
          Conv2d-153         [-1, 1024, 16, 16]       2,097,152
     BatchNorm2d-154         [-1, 1024, 16, 16]           2,048
            ReLU-155         [-1, 1024, 16, 16]               0
          Conv2d-156         [-1, 1024, 16, 16]         294,912
     BatchNorm2d-157         [-1, 1024, 16, 16]           2,048
            ReLU-158         [-1, 1024, 16, 16]               0
          Conv2d-159         [-1, 2048, 16, 16]       2,097,152
     BatchNorm2d-160         [-1, 2048, 16, 16]           4,096
            ReLU-161         [-1, 2048, 16, 16]               0
      Bottleneck-162         [-1, 2048, 16, 16]               0
          Conv2d-163         [-1, 1024, 16, 16]       2,097,152
     BatchNorm2d-164         [-1, 1024, 16, 16]           2,048
            ReLU-165         [-1, 1024, 16, 16]               0
          Conv2d-166         [-1, 1024, 16, 16]         294,912
     BatchNorm2d-167         [-1, 1024, 16, 16]           2,048
            ReLU-168         [-1, 1024, 16, 16]               0
          Conv2d-169         [-1, 2048, 16, 16]       2,097,152
     BatchNorm2d-170         [-1, 2048, 16, 16]           4,096
            ReLU-171         [-1, 2048, 16, 16]               0
      Bottleneck-172         [-1, 2048, 16, 16]               0
AdaptiveAvgPool2d-173           [-1, 2048, 1, 1]               0
          Linear-174                 [-1, 1000]       2,049,000
================================================================
Total params: 25,028,904
Trainable params: 25,028,904
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 1890.02
Params size (MB): 95.48
Estimated Total Size (MB): 1988.50
----------------------------------------------------------------

进程已结束,退出代码0


module1=models.alexnet()
module2=models.vgg16()
module3=models.resnet18()
module4=models.efficientnet_b0()
module5=models.resnext50_32x4d()

summary(module1,(3,512,512),device='cpu')
summary(module2,(3,512,512),device='cpu')
summary(module3,(3,512,512),device='cpu')
summary(module4,(3,512,512),device='cpu')
summary(module5,(3,512,512),device='cpu')
